**Create a Pandas column with a For Loop**

https://chrisalbon.com/python/data_wrangling/pandas_create_column_with_loop/

In [2]:
import pandas as pd
import numpy as np

**Create an example dataframe**

In [3]:
raw_data = {'student_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'test_score': [76, 88, 84, 67, 53, 96, 64, 91, 77, 73, 52, np.NaN]}

df = pd.DataFrame(raw_data, columns = ['student_name','test_score'])
df

   student_name  test_score
0        Miller        76.0
1      Jacobson        88.0
2           Ali        84.0
3        Milner        67.0
4         Cooze        53.0
5         Jacon        96.0
6        Ryaner        64.0
7          Sone        91.0
8         Sloan        77.0
9         Piger        73.0
10        Riani        52.0
11          Ali         NaN

**Create a function to assign letter grades**

In [4]:
#Create a list to store the data

grades = []

#For each row in the column
for score in df['test_score']:
    if score > 95:
        grades.append('A')
    elif score > 90:
        grades.append('A-')
    elif score > 85:
        grades.append('B')
    elif score > 80:
        grades.append('B-')
    elif score > 75:
        grades.append('C')
    elif score > 70:
        grades.append('C-')
    elif score > 65:
        grades.append('D')
    elif score > 60:
        grades.append('D-')
    else:
        grades.append('Failed')
        
#Create a column from the list
df['grades'] = grades

In [5]:
#View dataframe
df

   student_name  test_score  grades
0        Miller        76.0       C
1      Jacobson        88.0       B
2           Ali        84.0      B-
3        Milner        67.0       D
4         Cooze        53.0  Failed
5         Jacon        96.0       A
6        Ryaner        64.0      D-
7          Sone        91.0      A-
8         Sloan        77.0       C
9         Piger        73.0      C-
10        Riani        52.0  Failed
11          Ali         NaN  Failed

**Assign letter grades / categories using pd.cut for binning**

In [17]:

bins = [50,60,65,70,75,80,85,90,95,100]
group_labels = ['Failed','D-','D','C-','C','B-','B','A-','A']
df['categories'] = pd.cut(df['test_score'],bins,labels=group_labels)

In [18]:
df

   student_name  test_score  grades categories
0        Miller        76.0       C          C
1      Jacobson        88.0       B          B
2           Ali        84.0      B-         B-
3        Milner        67.0       D          D
4         Cooze        53.0  Failed     Failed
5         Jacon        96.0       A          A
6        Ryaner        64.0      D-         D-
7          Sone        91.0      A-         A-
8         Sloan        77.0       C          C
9         Piger        73.0      C-         C-
10        Riani        52.0  Failed     Failed
11          Ali         NaN  Failed        NaN